<script setup lang="ts">
import {Empty, Flex, Card, Tabs, TabPane, Spin, PageHeader} from "ant-design-vue";
import {h, ref} from "vue";
import {PlusSquareOutlined, MinusSquareOutlined, PrinterOutlined} from "@ant-design/icons-vue"
import {useApiStore} from "../store/apiStore.ts";



</script>

<template>
  <div id="globalContainer">
    <Flex vertical justify="flex-start" align="center" gap="large">
      <div id="headerContainer">
        <PageHeader style="border: 1px solid rgb(235, 237, 240)" title="结构化案例展示"/>
      </div>

      <div id="contentContainer">
        <Flex vertical justify="space-around" align="center" gap="large">
            <div id="titleContainer">
              <span>某甲公司诉上海某乙公司股东知情权纠纷案</span>
            </div>

            <div id="detailFuncContainer">
              <Flex justify="space-between" align="center" gap="large">
                <div id="detailContainer">
                  <span class="detailFuncText">案号：267-005</span>
                  <span class="detailFuncText">发布日期：2023-10-2</span>
                </div>
                <div id="funcContainer">
                  <span class="detailFuncText">字号：<PlusSquareOutlined /><MinusSquareOutlined /></span>
                  <span class="detailFuncText"><PrinterOutlined />打印本页</span>
                </div>
              </Flex>
            </div>

            <div id="textContainer">
              <Flex vertical justify="space-between" gap="small">
                <strong>某甲公司诉上海某乙公司股东知情权纠纷案</strong>

                <div id="keywordsContainer">
                  <Flex  justify="center" align="center">
                    <strong>关键词：</strong>
                    <span>民事</span>
                    <span>股东知情权</span>
                    <span>股东查阅权</span>
                    <span>公司章程</span>
                    <span>股份有限公司</span>
                  </Flex>
                </div>

                <div id="factContainer">
                  <Flex vertical justify="spance-between" align="flex-start" gap="0px">
                    <strong>基本案情</strong>
                    <p class="text">
                      被告上海某乙公司于2010年5月20日经批准整体改制为中外合资股份有限公司，原告某甲公司系上海某乙公司股东。<br/><br/>
                      2012年3月，上海某乙公司向中国证券监督管理委员会（以下简称“证监会”）报送上市并首次公开发行股票的申请材料。某会计师事务所
                      接受上海某乙公司委托对上海某乙公司将向证监会提交的有关公开发行A股股票的文件时需一并递交的2009年度至2011年度以及
                      延伸审计期间的按照财政部颁布的企业会计准则（2006）编制的财务报表进行审计。<br/><br/>
                      2012年6月7日，某会计师事务所致函某甲公司等上海某乙公司的全体股东，称：在对上海某乙公司相关期间财务报表进行审计的过程中，
                      发现上海某乙公司需进一步提供有关林业局征询函、银行询证函的相关信息及资料，来核实消耗性生物资产的所有权及银行存款的存在性和准确性。
                      考虑到上述事项的严重程度及可能对过往各个期间的财务报表造成的重大影响，希望上海某乙公司股东立即对上述事项进行独立核查，
                      立即采取措施以防止上述报告被进一步对外分发及被使用者信赖。<br/><br/>
                      2012年6、7月间，上海某乙公司撤回上市申报材料。<br/><br/>
                      2012年8月13日，上海某乙公司向股东出具现金自查报告，对2011年9月30日至2012年6月30日的现金资产进行了核查。
                      因某甲公司对上海某乙公司出具的现金自查报告以及上海某乙公司委托某会计师事务所出具的审计报告等存有异议，故与上海某乙公司沟通，
                      希望上海某乙公司配合其聘请的某咨询公司对农户补偿款及林权证等进行核查。<br/><br/>
                      2013年2月28日，某甲公司致函上海某乙公司要求查阅相关资料并对相关财务问题进行审计。上海某乙公司未予回复。<br/><br/>
                      原告起诉至法院，请求判令：1、判令被告向原告提供以下材料供原告查阅、复制：
                      自2008年8月30日至今被告及其所有子公司/分公司的所有财务报表；自2008年8月30日至今被告及其所有子公司/分公司的所有财务账簿，
                      包括但不限于总账、明细账（包括但不限于银行及现金、借款、按客户排列的应收账款、按客户排列的坏账准备、按客户排列的预收账款、
                      按供应商排列的应付账款、按供应商排列的预付账款、按供应商排列的其他应付款、应付票据、应收票据、无形资产）、日记账明细、至最末级科目的试算平衡表、其他辅助性账簿等；
                      自2008年8月30日至今被告及其所有子公司/分公司的会计凭证，包括但不限于记账凭证、相关原始凭证及作为原始凭证附件入账备查的有关资料等；
                      自2008年8月30日至今被告及其所有子公司/分公司的所有银行账户的对账单；自2008年8月30日至今被告股东会、股东大会召开所有会议的所有材料，
                      包括但不限于通知、会议记录、会议决议、授权委托文件、同意和通信等；
                      自2008年8月30日至今被告董事会召开所有会议的所有材料，包括但不限于通知、会议记录、会议决议、授权委托文件、同意和通信等；
                      自2008年8月30日至今被告监事会召开所有会议的所有材料、包括但不限于通知、会议记录、会议决议、授权委托文件、同意和通信等；
                      自2008年8月30日至今被告董事会下设战略与发展、提名、薪酬与考核、审计委员会召开所有会议的所有材料，包括但不限于通知、会议记录、会议决议、授权委托材料、同意和通信等；
                      自2008年8月30日至今被告及其所有子公司/分公司持有和曾经持有的所有林权证及其自2008年8月30日至今的交易合同、收付款记录等相关信息；
                      自2008年8月30日至今被告及其所有子公司/分公司为进行其持有和曾经持有的所有林权证的初始、变更和注销登记向相关林业管理部门提交的所有报备文件；
                      与系争1.96亿元农户补偿款相关的所有材料和信息，包括但不限于付款明细表（包含付款日期、收款人姓名/名称、收款人身份证号或单位注册号、收款人银行账号、付款金额等）、合同、通信、银行凭证、银行对账单、收据、发票等；
                      2011至2012年度被告及其所有子公司/分公司的公司组织架构；
                      2011至2012年度被告及其所有子公司/分公司销售和采购政策（包括定价政策和销售折扣政策）；
                      2011至2012年度被告及其所有子公司/分公司的伐木权及获取林业权等业务相关政策以及流程；
                      2011至2012年度被告及其所有子公司/分公司的现金、银行收支和银行借款的相关政策流程；
                      2011至2012年度被告及其所有子公司/分公司包含职位的员工名单；2、判令被告配合原告聘请的会计师事务所对被告以下财务问题进行审计并将审计结果交付原告：
                      被告及其所有子公司/分公司自2008年8月30日至今的银行收支情况和现金流动情况，包括系争1.96亿元农户补偿款的现金流出情况；
                      被告及其所有子公司/分公司自2008年8月30日至今持有或曾经持有的所有林权证的情况和所有林权证的变动情况。<br/><br/>
                      上海市静安区人民法院于2013年8月22日作出(2013)静民二(商)初字第S1041号民事判决：
                      一、被告上海某乙公司应于本判决生效之日起十日内将被告及其分公司自2008年8月30日至本判决生效之日止的财务会计报告交由原告某甲公司查阅；
                      二、被告上海某乙公司应于本判决生效之日起十日内将被告及其分公司自2008年8月30日至本判决生效之日止的股东大会会议记录交由原告某甲公司查阅；
                      三、被告上海某乙公司应于本判决生效之日起十日内将被告及其分公司自2008年8月30日至本判决生效之日止的董事会会议决议交由原告某甲公司查阅；
                      四、被告上海某乙公司应于本判决生效之日起十日内将被告及其分公司自2008年8月30日至本判决生效之日止的监事会会议决议交由原告某甲公司查阅；
                      五、原告的其余诉讼请求，不予支持。某甲公司不服，提起上诉。
                      上海市第二中级人民法院于2014年1月10日作出(2013)沪二中民四(商)终字第S1264号民事判决：
                      一、维持上海市静安区人民法院（2013）静民二（商）初字第S1041号民事判决第一项；
                      二、撤销上海市静安区人民法院（2013）静民二（商）初字第S1041号民事判决第二、三、四、五项；
                      三、被上诉人上海某乙公司应于本判决生效之日起十日内将该公司的子公司自2008年8月30日至本判决生效之日止的财务会计报告交由上诉人某甲公司查阅；
                      四、被上诉人上海某乙公司应于本判决生效之日起十日内将该公司股东大会自2008年8月30日至本判决生效之日止召开会议的通知、会议记录、授权委托文件、同意和通信材料备妥，供上诉人某甲公司查阅；
                      五、被上诉人上海某乙公司应于本判决生效之日起十日内将该公司董事会自2008年8月30日至本判决生效之日止召开会议的通知、会议记录、会议决议、授权委托文件、同意和通信材料备妥，供上诉人某甲公司查阅；
                      六、被上诉人上海某乙公司应于本判决生效之日起十日内将该公司监事会会议决议备妥，供上诉人某甲公司查阅；
                      七、被上诉人上海某乙公司应于本判决生效之日起十日内将该公司董事会下设战略与发展、提名、薪酬与考核、审计委员会自2008年8月30日至本判决生效之日止召开会议的通知、会议记录、授权委托文件、同意和通信材料备妥，供上诉人某甲公司查阅；
                      八、被上诉人上海某乙公司应于本判决生效之日起十日内将该公司及其分公司、子公司自2008年8月30日至本判决生效之日止的会计账簿、会计凭证备妥，供上诉人某甲公司查阅；
                      九、被上诉人上海某乙公司应于本判决生效之日起十日内将该公司及其分公司、子公司自2008年8月30日至本判决生效之日止持有和曾经持有的所有林权证及交易合同、收付款记录备妥，供上诉人某甲公司查阅；
                      十、被上诉人上海某乙公司应于本判决生效之日起十日内将该公司及其分公司、子公司自2008年8月30日至今为持有和曾经持有的所有林权证进行的初始、变更和注销登记向相关林业管理部门提交的所有报备文件交由上诉人某甲公司查阅；
                      十一、被上诉人上海某乙公司应于本判决生效之日起十日内将该公司及其分公司、子公司与系争1.96亿元农户补偿款相关的付款明细（包含付款日期、收款人姓名/名称、收款人身份证号或单位注册号、收款人银行账号、付款金额等）、合同、通信、银行凭证、银行对账单、收据、发票备妥，供上诉人某甲公司查阅；
                      十二、被上诉人上海某乙公司应配合上诉人某甲公司聘请的会计师事务所对以下财务问题进行审计：上海某乙公司及其分公司、子公司自2008年8月30日至今的银行收支情况和现金流动情况，包括系争1.96亿元农户补偿款的现金流出情况；上海某乙公司及其分公司、子公司自2008年8月30日至今持有或曾经持有的所有林权证的情况和所有林权证的变动情况。
                      十三、驳回上诉人某甲公司的其他诉讼请求。
                    </p>
                  </Flex>
                </div>

                <div id="reasonContainer">
                  <Flex vertical justify="spance-between" align="flex-start">
                    <strong>裁判理由</strong>
                    <p class="text">
                      法院生效裁判认为，公司章程是发起人之间通过意思自治的方式就公司设立、组织形式、经营管理、股东、董事、监事、高级管理人员的权利义务等事宜形成的准则性的文件，
                      是公司的宪章，在不违反法律禁止性规定的情况下，章程的规定应认定有效，对公司、股东、董事、监事、高级管理人员等均具有约束力，
                      股东有权依据公司章程的规定主张相应的知情权利。但诚如原审法院所认为的，公司法以例举方式对股份有限公司的股东知情权作出不同于有限责任公司的规定，
                      有其特定的立法意图，目的在保证股东享有了解公司经营状况的途径的同时，又将行使知情权可能对公司正常经营所造成的影响控制在合理的范围之内。
                      因此，对于股份有限公司的股东以公司章程为据所主张的相关的知情权利，应结合公司法的立法目的以及该股份有限公司的个体情况综合考量。<br/><br/>
                      关于某甲公司主张查阅上海某乙公司及其分公司自2008年8月30日至判决生效之日止的财务会计报告以及上海某乙公司的股东大会会议记录、
                      董事会会议决议、监事会会议决议，因具有公司法规定以及公司章程的约定，原审法院予以支持，符合法律规定，二审予以维持。
                      关于某甲公司要求查阅上海某乙公司子公司的财务报表以及上海某乙公司及其分公司、子公司的会计账簿问题。
                      由上述已查明的上海某乙公司章程第144条及第146条的规定可见，章程载明上海某乙公司应向股东提交子公司财务报表、股东享有检查公司及其子公司的会计账簿、记录和管理账目的权利。
                      前述章程的规定确超过公司法列举的股东知情权内容，考虑到上海某乙公司虽为股份有限公司，但股东仅有五名，只要股东合理地行使知情权，一般不会对公司的经营造成重大影响，故前述公司章程的相关规定不致无效。
                      何况某甲公司系因上海某乙公司申请上市过程中审计发现财务问题而主张行使知情权，理由正当，故二审认为某甲公司要求取得上海某乙公司子公司的会计报表并查阅上海某乙公司及其分公司、子公司的会计账簿，应获支持。
                      据此，二审对于原审判决未予支持某甲公司的此部分诉讼请求依法予以改判。
                      需要指出的是，一般而言，子公司是指有一定比例以上的股份被另一家公司所拥有或通过协议方式受到另一公司实际控制的公司，
                      鉴于上海某乙公司章程中未对子公司的范围作出明确界定，审理中当事人双方也未能就此达成一致意见，考虑到子公司本系依法独立享有民事权利、承担民事责任的法人，
                      为避免可能损害子公司其他股东的权利，故二审对章程中所涉子公司界定为系上海某乙公司的全资子公司。<br/><br/>
                      关于某甲公司请求查阅的资料范围问题。二审认为，公司章程规定明确、且该规定未违反法律法规禁止性规定、亦无违反公司法立法目的及价值取向的，股东有权在章程规定的范围内行使知情权，
                      据此，某甲公司要求查阅与股东大会会议、董事会会议、委员会会议相关的材料的诉讼请求，可予支持。关于会计凭证，因章程中已规定股东有权检查会计账簿、记录和管理账目，而会计凭证系佐证会计账簿记录是否正确的重要凭证，
                      结合上海某乙公司章程赋予了股东对于特定财务问题自行委托审计的权利的事实，而审计中必然需要审查会计凭证，故二审认为某甲公司请求查阅会计凭证的诉讼请求亦应予以支持。
                      关于某甲公司主张的与林权证相关的资料，因证据表明在上海某乙公司申请上市期间，负责审计的某会计师事务所认为与林业证相关的资金用度情况存在需进一步核查的必要，
                      故现某甲公司要求查阅该部分资料具有合理的理由，且有公司章程第146条规定为依据，故亦可支持。至于某甲公司的其他诉讼请求，缺乏法律及章程依据，且有部分与其他已获支持的诉讼请求存在重合，故二审不予支持。<br/><br/>
                      关于某甲公司请求复制材料的诉请问题。二审认为，公司法列举的股东知情权利仅限于查阅，上海某乙公司的章程中也仅规定公司应向股东提供相关信息及材料，而未注明可复制，故某甲公司要求复制材料缺乏依据，二审不予支持。<br/><br/>
                      关于某甲公司所提审计问题。公司法虽未明确股东可通过审计方式行使知情权，但该方式已通过记载于上海某乙公司章程的形式予以确定，且审计亦系股东了解公司经营状况的方式之一，该规定对于公司及股东均具有约束力，故某甲公司要求判令上海某乙公司配合其审计，可予支持。
                      1.本案争议焦点在于，公司章程突破了公司法关于股东行使知情权的范围，对股东知情权作出扩大化规定，是否可以作为股东行使知情权的依据。股东知情权纠纷是公司类诉讼较常见的一种。通常，该类案件公司章程约定的股东知情权范围与我国《公司法》第十一条或第九十七条规定范围相一致，案件所涉公司类型也以有限责任公司居多。因此，实务争议主要体现在查阅主体是否包括已退出的股东、查阅的范围是否包括原始凭证、查阅目的是否正当等方面，这些问题已有不少案例涉及并回应。
                      2.如何理解我国《公司法》第十一条和九十七条的规范属性？是强制性规范还是赋权性规范？如何看待这种在公司法规定之外的章程约定的效力？有效还是无效？本案对审理知情权案件提出了一个新的命题。对此，理论和实践中有不同的认识。第一种观点认为，应严格按照我国《公司法》明确规定的知情权行使范围，对章程超出我国《公司法》之外的约定均未支持。另一种意见指出，分析这一问题的总体思路应尊重公司章程的约定，只是对纳入知情权行使的子公司范围作了进一步界定。表面上看，两种意见是对公司章程相应条款的效力持不同意见，实际更深层次地反映出法官对公司法品格的不同把握。公司法是管制的还是自治的？公司法是公法还是私法？公司章程与公司法关系如何，是否允许章程“选出”公司法？公司诉讼实务往往会出现所谓审理中的疑难问题，其实这些疑难问题恰恰是上述理论问题在案件中的折射。司法应当如何介入公司自治，这是一个非常困扰又无法回避的问题，需要在大量案件审理中不断提炼、摸索。
                    </p>
                  </Flex>
                </div>

                <div id="argumentContainer">
                  <Flex vertical justify="spance-between" align="flex-start">
                    <strong>裁判要旨</strong>
                    <p class="text">
                      第一，公司章程可以合理扩展股东法定知情权的范围。从公司治理的角度而言，公司章程的作用包括两个方面，
                      一是公司设立和运作的指导文件，二是对股东权利义务进行约定。其中，股东知情权不仅是股东行使权利的基础，亦是保护股东权利的重要手段。
                      因此，作为内部治理手段的公司章程对股东知情权的约定也应得到尊重。从保护诚信角度而言，公司章程是股东自愿达成的公司自治规则，只要不违反法律禁止性规定，对公司及股东均有约束力。<br/><br/>
                      第二，公司章程可以规定母公司股东出于正当理由对子公司资料的查阅权。就股权结构与公司架构而言，母公司股东行使的查阅子公司资料的权利实质是母公司行使对子公司的知情权。
                      在母公司完全控股尤其系全资子公司的情况下，子公司利益与母公司利益具有高度一致性。<br/><br/>
                      第三，公司章程可以约定审计作为股东行使知情权方式。我国《公司法》规定的股东可以查阅范围包括公司章程、公司会议记录、公司会计报告等，这仅是知情权的部分行使载体。在经济活动中，以投资换股权的股东权利背后，股东知情权的真正客体是公司的存续经营管理状况与财务状况，且主要是财务状况。实践中，股东仅通过查阅公司财务报告等信息是难以了解公司真实财务状况的。这也是众多股东知情权纠纷案件中，股东要求查阅公司会计账簿、会计凭证的根本原因。就专业审计结论的准确性和客观性讲，第三方审计是股东行使知情权，了解公司真实财务信息的重要方式。股东知情权的行使，既要保证股东能够了解公司基本情况，又不致对公司经营造成不利影响。原则上公司章程规定的审计可以作为股东知情权的行使方式，但股东也不能随意行使审计权，在个案中股东行使审计权的方式，还要综合考虑案情予以判断。一是股东行使审计权必须要有正当且迫切的理由；二是股东行使审计权要限定审计范围，须将审计限定在股东要求查清的具体财务问题和具体时间段内，不能允许股东无限制地对公司进行全面审计；三是审计过程中对商业秘密依法保护。
                    </p>
                  </Flex>
                </div>

              <div id="argumentContainer">
                  <Flex vertical justify="spance-between" align="flex-start">
                    <strong>关联索引</strong>
                    <p class="text">
                      《中华人民共和国公司法》第11条、第33条、第97条<br/><br/>
                      一审：上海市静安区人民法院(2013)静民二(商)初字第S1041号民事判决（2013年8月22日）<br/><br/>
                      二审：上海市第二中级人民法院(2013)沪二中民四(商)终字第S1264号民事判决（2014年1月10日）
                    </p>
                  </Flex>
                </div>
              </Flex>
            </div>

            <div id="linkContainer">

            </div>
        </Flex>
      </div>

    </Flex>
  </div>
</template>

<style scoped>
#globalContainer {
  width: 100%;
  height: 100%;
}

#globalContainer > :first-child {
  width: 100%;
  height: 100%;
}

#headerContainer {
  width: 100%;
  height: 15%;
  background-color: white;
}

#headerContainer > :first-child {
  width: 100%;
  height: 100%;
}

#contentContainer {
  width: 80%;
  padding: 5vh;
  background-color: white;
}

#contentContainer > :first-child {
  width: 100%;
  height: 100%;
}

#titleContainer {
  width: 100%;
}

#titleContainer > span {
  line-height: 1.6;
  font-size: 28px;
  text-align: center;
  overflow: hidden;
}

#detailFuncContainer {
  width: 100%;
  border: 0;
  border-bottom-width: 1px;
  border-bottom: #d0d0d5;
  border-bottom-style: solid;
}

#detailFuncContainer > :first-child {
  width: 100%;
  height: 100%;
}

.detailFuncText {
  font-size: 16px;
  padding: 10px;
}

#detailFuncContainer .anticon {
  padding: 8px;
}

#detailContainer {
  width: 30%;
}

#funcContainer {
  width: 25%;
}

#textContainer {
  width: 100%;
}

#textContainer > :first-child {
  width: 100%;
}

#keywordsContainer {
  width: 100%;
}

#keywordsContainer > :first-child {
  width: 100%;
}

#keywordsContainer span {
  padding: 5px;
}

#factContainer {
  width: 100%;
}

.text {
  text-align: left;
  white-space: pre-wrap;
}
</style>


